In [222]:
import pandas as pd

# Pandas Practice
___

### 1. Importing Pandas
- Pandas has a reference to both "Panel Data" and "Pyhton Data Analysis"

- Import Pandas in the applications by adding the import keyword

- Pandas is usually imported under the pd alias.

In [223]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

df = pd.DataFrame(mydataset)
print(df)
print(df.cars)
print(df['cars'])

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2
0      BMW
1    Volvo
2     Ford
Name: cars, dtype: object
0      BMW
1    Volvo
2     Ford
Name: cars, dtype: object

In [224]:
print(pd.options.display.max_rows)

60

In my system the number is 60, which means that if the DataFrame contains more than 60 rows, the print(df) statement will return only the headers and the first and last 5 rows.


You can change the maximum rows number with the same statement.

In [225]:
# pd.options.display.max_rows = 9999

In [226]:
df = pd.read_csv('C:/Users/User 1/Desktop/Ai_Ml_QB/pandas/17_06/data.csv')

In [227]:
print(df.to_string())

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
5          60    102       127     300.0
6          60    110       136     374.0
7          45    104       134     253.3
8          30    109       133     195.1
9          60     98       124     269.0
10         60    103       147     329.3
11         60    100       120     250.7
12         60    106       128     345.3
13         60    104       132     379.3
14         60     98       123     275.0
15         60     98       120     215.2
16         60    100       120     300.0
17         45     90       112       NaN
18         60    103       123     323.0
19         45     97       125     243.0
20         60    108       131     364.2
21         45    100       119     282.0
22         60    130       101     300.0
23         45    105       132     246.0
24         60    102       126     334.5
25         60    100       120     250.0
26         60     92       118     241.0
27         60    103       132       NaN
28         60    100       132     280.0
29         60    102       129     380.3
30         60     92       115     243.0
31         45     90       112     180.1
32         60    101       124     299.0
33         60     93       113     223.0
34         60    107       136     361.0
35         60    114       140     415.0
36         60    102       127     300.0
37         60    100       120     300.0
38         60    100       120     300.0
39         45    104       129     266.0
40         45     90       112     180.1
41         60     98       126     286.0
42         60    100       122     329.4
43         60    111       138     400.0
44         60    111       131     397.0
45         60     99       119     273.0
46         60    109       153     387.6
47         45    111       136     300.0
48         45    108       129     298.0
49         60    111       139     397.6
50         60    107       136     380.2
51         80    123       146     643.1
52         60    106       130     263.0
53         60    118       151     486.0
54         30    136       175     238.0
55         60    121       146     450.7
56         60    118       121     413.0
57         45    115       144     305.0
58         20    153       172     226.4
59         45    123       152     321.0
60        210    108       160    1376.0
61        160    110       137    1034.4
62        160    109       135     853.0
63         45    118       141     341.0
64         20    110       130     131.4
65        180     90       130     800.4
66        150    105       135     873.4
67        150    107       130     816.0
68         20    106       136     110.4
69        300    108       143    1500.2
70        150     97       129    1115.0
71         60    109       153     387.6
72         90    100       127     700.0
73        150     97       127     953.2
74         45    114       146     304.0
75         90     98       125     563.2
76         45    105       134     251.0
77         45    110       141     300.0
78        120    100       130     500.4
79        270    100       131    1729.0
80         30    159       182     319.2
81         45    149       169     344.0
82         30    103       139     151.1
83        120    100       130     500.0
84         45    100       120     225.3
85         30    151       170     300.0
86         45    102       136     234.0
87        120    100       157    1000.1
88         45    129       103     242.0
89         20     83       107      50.3
90        180    101       127     600.1
91         45    107       137       NaN
92         30     90       107     105.3
93         15     80       100      50.5
94         20    150       171     127.4
95         20    151       168     229.4
96         30     95       128     128.2
97         25    152       168     244.2
98         30    109       131     188.2
99         90     93       124     604.1
100        20     95       112      77.7
101        90     90       110     500.0
102        90     90       100     500.0
103        90     90       100     500.4
104        30     92       108      92.7
105        30     93       128     124.0
106       180     90       120     800.3
107        30     90       120      86.2
108        90     90       120     500.3
109       210    137       184    1860.4
110        60    102       124     325.2
111        45    107       124     275.0
112        15    124       139     124.2
113        45    100       120     225.3
114        60    108       131     367.6
115        60    108       151     351.7
116        60    116       141     443.0
117        60     97       122     277.4
118        60    105       125       NaN
119        60    103       124     332.7
120        30    112       137     193.9
121        45    100       120     100.7
122        60    119       169     336.7
123        60    107       127     344.9
124        60    111       151     368.5
125        60     98       122     271.0
126        60     97       124     275.3
127        60    109       127     382.0
128        90     99       125     466.4
129        60    114       151     384.0
130        60    104       134     342.5
131        60    107       138     357.5
132        60    103       133     335.0
133        60    106       132     327.5
134        60    103       136     339.0
135        20    136       156     189.0
136        45    117       143     317.7
137        45    115       137     318.0
138        45    113       138     308.0
139        20    141       162     222.4
140        60    108       135     390.0
141        60     97       127       NaN
142        45    100       120     250.4
143        45    122       149     335.4
144        60    136       170     470.2
145        45    106       126     270.8
146        60    107       136     400.0
147        60    112       146     361.9
148        30    103       127     185.0
149        60    110       150     409.4
150        60    106       134     343.0
151        60    109       129     353.2
152        60    109       138     374.0
153        30    150       167     275.8
154        60    105       128     328.0
155        60    111       151     368.5
156        60     97       131     270.4
157        60    100       120     270.4
158        60    114       150     382.8
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

to_string() to print the entire DataFrame.

### 2. Pandas Series
- A Pandas Series is like a column in a table.

- It is a one-dimensional array holding data of any type.

In [228]:
a = list(range(1,10,2))
print(type(a))
myvar = pd.Series(a)
print(myvar)
print(type(myvar))

<class 'list'>
0    1
1    3
2    5
3    7
4    9
dtype: int64
<class 'pandas.core.series.Series'>

#### 2.1 Labels
- If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.

- This label can be used to access a specified value`````````

In [229]:
print(myvar)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [230]:
print(myvar[0])

1

##### 2.1.1 Create Labels
- With the index argument, we can name our own labels.

In [231]:
a = [1,20,30]
myvar = pd.Series(a, index=['x','y','z'])
myvar

x     1
y    20
z    30
dtype: int64

- When we have created labels, we can access an item by referring to the label.

In [232]:
print(myvar['x'])

1

##### 2.2 Key/Value Objects as Series
- Can also use a key/value object, like a dictionary, when creating a Series.

-  The keys of the dictionary become the labels.

In [233]:
steps = {'day1': 100, 'day2': 200, 'day3': 300}
myvar = pd.Series(steps)
print(myvar)

day1    100
day2    200
day3    300
dtype: int64

- To select only some of the items in the dictionary, use the index argument and specify only the items we want to include in the Series.

In [234]:
# Create a Series using only data from "day1" and "day2":
steps = {'day1': 100, 'day2': 200, 'day3': 300}
myvar = pd.Series(steps, index=['day3','day2'])
print(myvar)

day3    300
day2    200
dtype: int64

### 3. Data Frames (DataFrame)
- Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

- Series is like a column, a DataFrame is the whole table.

- A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [235]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45],
  'temp': [38,49,36],
  0: [10,2030,20]
}

df = pd.DataFrame(data)

df

   calories  duration  temp     0
0       420        50    38    10
1       380        40    49  2030
2       390        45    36    20

In [236]:
print(type(data))
print(type(df))

<class 'dict'>
<class 'pandas.core.frame.DataFrame'>

#### 3.1 Locate Row
- Pandas use the loc attribute to return one or more specified row(s)

In [260]:
print(df.loc[0])

Car                   1
Brand            Toyota
Model           Corolla
Year               2018
Engine_Size        1.8L
Fuel_Type        Petrol
Mileage_(km)    42000.0
Price_(USD)     14500.0
Owner_type        First
Name: 0, dtype: object

In [237]:
print(df.loc[[1,0,2]]) #second[] is list

   calories  duration  temp     0
1       380        40    49  2030
0       420        50    38    10
2       390        45    36    20

##### 3.2.1 Named Indexes
- Use the named index in the loc attribute to return the specified row(s).

In [264]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

In [270]:
#refer to the named index:
print(df.loc["day2"])
# print(df.loc[1])
print(df.iloc[1])

calories    380
duration     40
Name: day2, dtype: int64
calories    380
duration     40
Name: day2, dtype: int64

#refer to the named index:
print(df.loc[["day2","day1"]])

In [240]:
df = pd.read_csv('C:/Users/User 1/Desktop/Ai_Ml_QB/pandas/17_06/cars_advanced.csv')

In [241]:
print(df.to_string())

    Car          Brand     Model  Year Engine Size Fuel Type  Mileage (km)  Price (USD) Owner Type
0     1         Toyota   Corolla  2018        1.8L    Petrol       42000.0      14500.0      First
1     2          Honda     Civic  2020        2.0L    petrol       25000.0      18000.0      First
2     3           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
3     4        Hyundai   Elantra  2019         NaN    Petrol       35000.0      16000.0      first
4     5            BMW  3 Series  2016        2.0L    diesel       70000.0          NaN      Third
5     6  Mercedes-Benz   C Class  2018        2.0L    Petrol       40000.0      28000.0      First
6     7          Tesla   Model 3  2021    Electric  electric       15000.0      35000.0      First
7     8            Kia    Optima  2017        2.4L    Petrol       50000.0      13000.0     Second
8     9           Audi        A4  2019        2.0L    Diesel       30000.0      27000.0     Second
9    10      Chevrolet    Malibu  2016        1.5L    Petrol        -500.0      11000.0      third
10   11          Honda     Civic  2020        2.0L    Petrol       25000.0      18000.0      First
11   12           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
12   13            NaN    Accord  2018        2.4L    Petrol       45000.0      19000.0      First
13   14         Toyota     Camry  2015        2.5L    Petrol           NaN      14000.0     Second
14   15            BMW  3 series  2016        2.0L    Diesel       70000.0      20000.0      third

#    Pandas Read Json

#### pd.read_json('')

In [242]:
df = pd.read_json('C:/Users/User 1/Desktop/Ai_Ml_QB/contact.json')
print(df.to_string())

              bb  cc
name          bb  cc
phone_number  bb  cc
email         bb  cc

### 5 Pandas - Analyzing DataFrames

#### 5.1 Viewing the Data
- One of the most used method for getting a quick overview of the DataFrame, is the **head()** method.

- The **head()** method returns the headers and a specified number of rows, starting from the top.

- if we don't mention then it display the first 5 rows

In [243]:
df = pd.read_csv('C:/Users/User 1/Desktop/Ai_Ml_QB/pandas/17_06/cars_advanced.csv')
print(df.head())

   Car    Brand     Model  Year Engine Size Fuel Type  Mileage (km)  \
0    1   Toyota   Corolla  2018        1.8L    Petrol       42000.0
1    2    Honda     Civic  2020        2.0L    petrol       25000.0
2    3     Ford     Focus  2017        1.5L    Diesel       60000.0
3    4  Hyundai   Elantra  2019         NaN    Petrol       35000.0
4    5      BMW  3 Series  2016        2.0L    diesel       70000.0

   Price (USD) Owner Type
0      14500.0      First
1      18000.0      First
2      12500.0     Second
3      16000.0      first
4          NaN      Third

In [244]:
print(df.head(10).to_string())

   Car          Brand     Model  Year Engine Size Fuel Type  Mileage (km)  Price (USD) Owner Type
0    1         Toyota   Corolla  2018        1.8L    Petrol       42000.0      14500.0      First
1    2          Honda     Civic  2020        2.0L    petrol       25000.0      18000.0      First
2    3           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
3    4        Hyundai   Elantra  2019         NaN    Petrol       35000.0      16000.0      first
4    5            BMW  3 Series  2016        2.0L    diesel       70000.0          NaN      Third
5    6  Mercedes-Benz   C Class  2018        2.0L    Petrol       40000.0      28000.0      First
6    7          Tesla   Model 3  2021    Electric  electric       15000.0      35000.0      First
7    8            Kia    Optima  2017        2.4L    Petrol       50000.0      13000.0     Second
8    9           Audi        A4  2019        2.0L    Diesel       30000.0      27000.0     Second
9   10      Chevrolet    Malibu  2016        1.5L    Petrol        -500.0      11000.0      third

- There is also a **tail()** method for viewing the last rows of the DataFrame.

- The **tail()** method returns the headers and a specified number of rows, starting from the bottom.

In [245]:
print(df.tail())

    Car   Brand     Model  Year Engine Size Fuel Type  Mileage (km)  \
10   11   Honda     Civic  2020        2.0L    Petrol       25000.0
11   12    Ford     Focus  2017        1.5L    Diesel       60000.0
12   13     NaN    Accord  2018        2.4L    Petrol       45000.0
13   14  Toyota     Camry  2015        2.5L    Petrol           NaN
14   15     BMW  3 series  2016        2.0L    Diesel       70000.0

    Price (USD) Owner Type
10      18000.0      First
11      12500.0     Second
12      19000.0      First
13      14000.0     Second
14      20000.0      third

In [246]:
print(df.tail(7).to_string())

    Car      Brand     Model  Year Engine Size Fuel Type  Mileage (km)  Price (USD) Owner Type
8     9       Audi        A4  2019        2.0L    Diesel       30000.0      27000.0     Second
9    10  Chevrolet    Malibu  2016        1.5L    Petrol        -500.0      11000.0      third
10   11      Honda     Civic  2020        2.0L    Petrol       25000.0      18000.0      First
11   12       Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
12   13        NaN    Accord  2018        2.4L    Petrol       45000.0      19000.0      First
13   14     Toyota     Camry  2015        2.5L    Petrol           NaN      14000.0     Second
14   15        BMW  3 series  2016        2.0L    Diesel       70000.0      20000.0      third


- We can also get random rows using **sample()**

- by default 1

In [247]:
df.sample()

,Car,Brand,Model,Year,Engine Size,Fuel Type,Mileage (km),Price (USD),Owner Type
1,2,Honda,Civic,2020,2.0L,petrol,25000.0,18000.0,First

In [248]:
df.sample(7)

,Car,Brand,Model,Year,Engine Size,Fuel Type,Mileage (km),Price (USD),Owner Type
1,2,Honda,Civic,2020,2.0L,petrol,25000.0,18000.0,First
9,10,Chevrolet,Malibu,2016,1.5L,Petrol,-500.0,11000.0,third
8,9,Audi,A4,2019,2.0L,Diesel,30000.0,27000.0,Second
5,6,Mercedes-Benz,C Class,2018,2.0L,Petrol,40000.0,28000.0,First
14,15,BMW,3 series,2016,2.0L,Diesel,70000.0,20000.0,third
12,13,NaN,Accord,2018,2.4L,Petrol,45000.0,19000.0,First
0,1,Toyota,Corolla,2018,1.8L,Petrol,42000.0,14500.0,First

#### random_state:- using this we get same random o/p

- random_state = 1 (we can pass any integer)

In [249]:
df.sample(5, random_state=1) # this will give same combination every time
# can put any interger in 'random_state'

,Car,Brand,Model,Year,Engine Size,Fuel Type,Mileage (km),Price (USD),Owner Type
3,4,Hyundai,Elantra,2019,NaN,Petrol,35000.0,16000.0,first
7,8,Kia,Optima,2017,2.4L,Petrol,50000.0,13000.0,Second
6,7,Tesla,Model 3,2021,Electric,electric,15000.0,35000.0,First
2,3,Ford,Focus,2017,1.5L,Diesel,60000.0,12500.0,Second
10,11,Honda,Civic,2020,2.0L,Petrol,25000.0,18000.0,First

#### 5.2 Info About the Data
- The DataFrames object has a method called **info()**, that gives us more information about the data set.

- The **info()** method also tells us how many Non-Null values there are present in each column

In [250]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Car           15 non-null     int64
 1   Brand         14 non-null     object
 2   Model         15 non-null     object
 3   Year          15 non-null     int64
 4   Engine Size   14 non-null     object
 5   Fuel Type     15 non-null     object
 6   Mileage (km)  14 non-null     float64
 7   Price (USD)   14 non-null     float64
 8   Owner Type    15 non-null     object
dtypes: float64(2), int64(2), object(5)
memory usage: 1.2+ KB

- We can see all the columns and rows by using **tolist()** method

In [251]:
print(df.columns)
print(df.columns.to_list()) #pandas origin
print(df.columns.tolist()) #numpy origin

Index(['Car', 'Brand', 'Model', 'Year', 'Engine Size', 'Fuel Type',
       'Mileage (km)', 'Price (USD)', 'Owner Type'],
      dtype='object')
['Car', 'Brand', 'Model', 'Year', 'Engine Size', 'Fuel Type', 'Mileage (km)', 'Price (USD)', 'Owner Type']
['Car', 'Brand', 'Model', 'Year', 'Engine Size', 'Fuel Type', 'Mileage (km)', 'Price (USD)', 'Owner Type']

In [252]:
df.describe()

             Car         Year  Mileage (km)   Price (USD)
count  15.000000    15.000000     14.000000     14.000000
mean    8.000000  2017.800000  40464.285714  18464.285714
std     4.472136     1.740279  20692.310246   7009.510807
min     1.000000  2015.000000   -500.000000  11000.000000
25%     4.500000  2016.500000  26250.000000  13250.000000
50%     8.000000  2018.000000  41000.000000  17000.000000
75%    11.500000  2019.000000  57500.000000  19750.000000
max    15.000000  2021.000000  70000.000000  35000.000000

#### 6.1 Remove Rows
- One way to deal with empty cells is to remove rows that contain empty cells.

- This is usually OK, since data sets can be very big, and removing a few rows will not have a big impact on the result.

- By default, the **dropna()** method returns a new DataFrame, and will not change the original.

- If we want to change the original DataFrame, we can use the **inplace = True argument**

In [253]:
print(df.to_string())
print("-"*40)
new_df = df.dropna()
print(new_df.to_string())
print("-"*40)
print(len(df), len(new_df))

    Car          Brand     Model  Year Engine Size Fuel Type  Mileage (km)  Price (USD) Owner Type
0     1         Toyota   Corolla  2018        1.8L    Petrol       42000.0      14500.0      First
1     2          Honda     Civic  2020        2.0L    petrol       25000.0      18000.0      First
2     3           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
3     4        Hyundai   Elantra  2019         NaN    Petrol       35000.0      16000.0      first
4     5            BMW  3 Series  2016        2.0L    diesel       70000.0          NaN      Third
5     6  Mercedes-Benz   C Class  2018        2.0L    Petrol       40000.0      28000.0      First
6     7          Tesla   Model 3  2021    Electric  electric       15000.0      35000.0      First
7     8            Kia    Optima  2017        2.4L    Petrol       50000.0      13000.0     Second
8     9           Audi        A4  2019        2.0L    Diesel       30000.0      27000.0     Second
9    10      Chevrolet    Malibu  2016        1.5L    Petrol        -500.0      11000.0      third
10   11          Honda     Civic  2020        2.0L    Petrol       25000.0      18000.0      First
11   12           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
12   13            NaN    Accord  2018        2.4L    Petrol       45000.0      19000.0      First
13   14         Toyota     Camry  2015        2.5L    Petrol           NaN      14000.0     Second
14   15            BMW  3 series  2016        2.0L    Diesel       70000.0      20000.0      third
----------------------------------------
    Car          Brand     Model  Year Engine Size Fuel Type  Mileage (km)  Price (USD) Owner Type
0     1         Toyota   Corolla  2018        1.8L    Petrol       42000.0      14500.0      First
1     2          Honda     Civic  2020        2.0L    petrol       25000.0      18000.0      First
2     3           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
5     6  Mercedes-Benz   C Class  2018        2.0L    Petrol       40000.0      28000.0      First
6     7          Tesla   Model 3  2021    Electric  electric       15000.0      35000.0      First
7     8            Kia    Optima  2017        2.4L    Petrol       50000.0      13000.0     Second
8     9           Audi        A4  2019        2.0L    Diesel       30000.0      27000.0     Second
9    10      Chevrolet    Malibu  2016        1.5L    Petrol        -500.0      11000.0      third
10   11          Honda     Civic  2020        2.0L    Petrol       25000.0      18000.0      First
11   12           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
14   15            BMW  3 series  2016        2.0L    Diesel       70000.0      20000.0      third
----------------------------------------
15 11

Note: Now, the dropna(inplace = True) will NOT return a new DataFrame, but it will remove all rows containing NULL values from the original DataFrame.

#### 6.2 Replace Empty Values
- Another way of dealing with empty cells is to insert a new value instead.

- This way we do not have to delete entire rows just because of some empty cells.

- The **fillna()** method allows us to replace empty cells with a value

##### 6.2.1 Replacing by a Static value

In [254]:
# df.fillna({'Engine Size' : '1.5l'}, inplace=True)
df.fillna({'Price (USD)' : 16000.0}, inplace=True)
df.fillna({'Brand' : 'Honda'}, inplace=True)
df.fillna({'Mileage (km)' : 70000.0 }, inplace=True)

#2nd method but gives the warning because indirectly it uses uper one 
df['Engine Size'].fillna('1.51', inplace=True)
print(df.to_string())

    Car          Brand     Model  Year Engine Size Fuel Type  Mileage (km)  Price (USD) Owner Type
0     1         Toyota   Corolla  2018        1.8L    Petrol       42000.0      14500.0      First
1     2          Honda     Civic  2020        2.0L    petrol       25000.0      18000.0      First
2     3           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
3     4        Hyundai   Elantra  2019        1.51    Petrol       35000.0      16000.0      first
4     5            BMW  3 Series  2016        2.0L    diesel       70000.0      16000.0      Third
5     6  Mercedes-Benz   C Class  2018        2.0L    Petrol       40000.0      28000.0      First
6     7          Tesla   Model 3  2021    Electric  electric       15000.0      35000.0      First
7     8            Kia    Optima  2017        2.4L    Petrol       50000.0      13000.0     Second
8     9           Audi        A4  2019        2.0L    Diesel       30000.0      27000.0     Second
9    10      Chevrolet    Malibu  2016        1.5L    Petrol        -500.0      11000.0      third
10   11          Honda     Civic  2020        2.0L    Petrol       25000.0      18000.0      First
11   12           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
12   13          Honda    Accord  2018        2.4L    Petrol       45000.0      19000.0      First
13   14         Toyota     Camry  2015        2.5L    Petrol       70000.0      14000.0     Second
14   15            BMW  3 series  2016        2.0L    Diesel       70000.0      20000.0      third

C:\Users\User 1\AppData\Local\Temp\ipykernel_2144\3393889597.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Engine Size'].fillna('1.51', inplace=True)

##### 6.2.2 Replace Using Mean, Median, or Mode

- A common way to replace empty cells, is to calculate the mean, median or mode value of the column.

- Pandas uses the mean() median() and mode() methods to calculate the respective values for a specified column

Mean = the average value (the sum of all values divided by number of values).

Median = the value in the middle, after you have sorted all values ascending.

Mode = the value that appears most frequently.

In [255]:
print(df["Brand"].mode()) #1st
print(df.Brand.mode()) #2nd

print("-"*40)

print(df["Brand"].mode()[0]) #1st
print(df.Brand.mode()[0]) #2nd

#we uses mode()[0] 0 for the first value (exa - honda)

0    Honda
Name: Brand, dtype: object
0    Honda
Name: Brand, dtype: object
----------------------------------------
Honda
Honda

In [256]:
x = df["Brand"].mode()[0]
y = df["Engine Size"].mode()[0]
z = df["Mileage (km)"].mean()
w = df["Price (USD)"].median()

df.fillna({"Brand": x}, inplace=True)
df.fillna({"Engine Size": y}, inplace=True)
df.fillna({"Mileage (km)": z}, inplace=True)
df.fillna({"Price (USD)": w}, inplace=True)
# df["Brand"].fillna(x, inplace = True)


print(df.to_string())

    Car          Brand     Model  Year Engine Size Fuel Type  Mileage (km)  Price (USD) Owner Type
0     1         Toyota   Corolla  2018        1.8L    Petrol       42000.0      14500.0      First
1     2          Honda     Civic  2020        2.0L    petrol       25000.0      18000.0      First
2     3           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
3     4        Hyundai   Elantra  2019        1.51    Petrol       35000.0      16000.0      first
4     5            BMW  3 Series  2016        2.0L    diesel       70000.0      16000.0      Third
5     6  Mercedes-Benz   C Class  2018        2.0L    Petrol       40000.0      28000.0      First
6     7          Tesla   Model 3  2021    Electric  electric       15000.0      35000.0      First
7     8            Kia    Optima  2017        2.4L    Petrol       50000.0      13000.0     Second
8     9           Audi        A4  2019        2.0L    Diesel       30000.0      27000.0     Second
9    10      Chevrolet    Malibu  2016        1.5L    Petrol        -500.0      11000.0      third
10   11          Honda     Civic  2020        2.0L    Petrol       25000.0      18000.0      First
11   12           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
12   13          Honda    Accord  2018        2.4L    Petrol       45000.0      19000.0      First
13   14         Toyota     Camry  2015        2.5L    Petrol       70000.0      14000.0     Second
14   15            BMW  3 series  2016        2.0L    Diesel       70000.0      20000.0      third

### 7. Pandas - Cleaning Data of Wrong Data

- Cells with data of wrong format can make it difficult, or even impossible, to analyze data.

- To fix it, you have two options: remove the rows, or convert all cells in the columns into the same format.

In [257]:
df.rename(columns={'Engine Size': 'Engine_Size',
                   'Fuel Type': 'Fuel_Type',
                   'Mileage (km)': 'Mileage_(km)',
                   'Price (USD)': 'Price_(USD)',
                   'Owner Type': 'Owner_type'}, inplace=True)

In [258]:
print(df.to_string())

    Car          Brand     Model  Year Engine_Size Fuel_Type  Mileage_(km)  Price_(USD) Owner_type
0     1         Toyota   Corolla  2018        1.8L    Petrol       42000.0      14500.0      First
1     2          Honda     Civic  2020        2.0L    petrol       25000.0      18000.0      First
2     3           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
3     4        Hyundai   Elantra  2019        1.51    Petrol       35000.0      16000.0      first
4     5            BMW  3 Series  2016        2.0L    diesel       70000.0      16000.0      Third
5     6  Mercedes-Benz   C Class  2018        2.0L    Petrol       40000.0      28000.0      First
6     7          Tesla   Model 3  2021    Electric  electric       15000.0      35000.0      First
7     8            Kia    Optima  2017        2.4L    Petrol       50000.0      13000.0     Second
8     9           Audi        A4  2019        2.0L    Diesel       30000.0      27000.0     Second
9    10      Chevrolet    Malibu  2016        1.5L    Petrol        -500.0      11000.0      third
10   11          Honda     Civic  2020        2.0L    Petrol       25000.0      18000.0      First
11   12           Ford     Focus  2017        1.5L    Diesel       60000.0      12500.0     Second
12   13          Honda    Accord  2018        2.4L    Petrol       45000.0      19000.0      First
13   14         Toyota     Camry  2015        2.5L    Petrol       70000.0      14000.0     Second
14   15            BMW  3 series  2016        2.0L    Diesel       70000.0      20000.0      third

In [ ]:
df.loc[0] #uses label

Car                   1
Brand            Toyota
Model           Corolla
Year               2018
Engine_Size        1.8L
Fuel_Type        Petrol
Mileage_(km)    42000.0
Price_(USD)     14500.0
Owner_type        First
Name: 0, dtype: object

In [ ]:
df.iloc[0] #uses indexs

Car                   1
Brand            Toyota
Model           Corolla
Year               2018
Engine_Size        1.8L
Fuel_Type        Petrol
Mileage_(km)    42000.0
Price_(USD)     14500.0
Owner_type        First
Name: 0, dtype: object